In [2]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

In [3]:
conn = sqlite3.connect("../sneaker_scraper/main_sneakers.db")

In [4]:
before_2001 = pd.read_sql_query("select * from before_2001;", conn)
year_2001 = pd.read_sql_query("select * from year2001;", conn)
year_2002 = pd.read_sql_query("select * from year2002;", conn)
year_2003 = pd.read_sql_query("select * from year2003;", conn)
year_2004 = pd.read_sql_query("select * from year2004;", conn)
year_2005 = pd.read_sql_query("select * from year2005;", conn)
year_2006 = pd.read_sql_query("select * from year2006;", conn)
year_2007 = pd.read_sql_query("select * from year2007;", conn)
year_greater = pd.read_sql_query("select * from year2008_and_09;", conn)

In [5]:
all_years = pd.concat([before_2001, year_2001, year_2002, year_2003, year_2004, year_2005, year_2006, year_2007, year_greater])

In [30]:
all_years.to_csv('sneakers.csv')

In [8]:
# all_years
all_years = all_years.drop_duplicates(subset="sneaker", keep="first")

In [10]:
test = all_years.head()

In [11]:
test

   id                             sneaker price   brand                 date
0   1   ['Jordan 15 OG Low Black Silver']   300  Jordan  release: 09/06/2000
1   2      ['Jordan 15 OG Low White Red']   300  Jordan  release: 01/01/2000
2   3  ['Jordan 15 OG Low Midnight Navy']   325  Jordan  release: 01/01/2000
3   4         ['Jordan 14 OG Low Ginger']   755  Jordan  release: 09/15/1999
4   5  ['Jordan 14 OG Low Columbia Blue']   399  Jordan  release: 08/04/1999

In [38]:
#  test.columns = test.columns.str.strip().str.lower().str.replace('release:', '')

In [39]:
test

   id                          sneaker price   brand                 date
0   1   jordan 15 og low black silver'   300  Jordan  release: 09/06/2000
1   2      jordan 15 og low white red'   300  Jordan  release: 01/01/2000
2   3  jordan 15 og low midnight navy'   325  Jordan  release: 01/01/2000
3   4         jordan 14 og low ginger'   755  Jordan  release: 09/15/1999
4   5  jordan 14 og low columbia blue'   399  Jordan  release: 08/04/1999